loadtest.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 1  # 1 request per second
scenarios:
  - flow:
      - post:
          url: "/generate-pdf"
          headers:
            Content-Type: "application/json"  # Specify JSON format
          body: '{"fullName": "John Doe"}'  # Correctly formatted JSON body